nlp/training-note-GPU.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-11-15 Mon 20:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>在GPU上进行训练的一些指南</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="LiangZi" />
<link rel="stylesheet" type="text/css" href="~/liangzid.github.io/notes/css/worg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">在GPU上进行训练的一些指南</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgbeaa741">1. GPU数目决策及主GPU设置</a>
<ul>
<li><a href="#org248b26a">1.1. 优势劣势比较</a></li>
<li><a href="#orgcb1b4aa">1.2. 单GPU模式指定主GPU</a></li>
<li><a href="#orgbd46aab">1.3. 多GPU模式使用与指定主GPU</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgbeaa741" class="outline-2">
<h2 id="orgbeaa741"><span class="section-number-2">1</span> GPU数目决策及主GPU设置</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org248b26a" class="outline-3">
<h3 id="org248b26a"><span class="section-number-3">1.1</span> 优势劣势比较</h3>
<div class="outline-text-3" id="text-1-1">
<p>
单GPU模式常常可以训练在多GPU上出现out of memory现象的代码。这可能是因为：无论是单GPU还是多GPU，
模型参数和数据集都需要加载在一个主GPU上（对应.to(device)操作），因此，多GPU或会对该主GPU产生更大的
负担，因此，当数据较大、内存不足时，使用单GPU反而比多GPU要好。
</p>
</div>
</div>
<div id="outline-container-orgcb1b4aa" class="outline-3">
<h3 id="orgcb1b4aa"><span class="section-number-3">1.2</span> 单GPU模式指定主GPU</h3>
<div class="outline-text-3" id="text-1-2">
<p>
说出来可能不信，单GPU也要指定主GPU！不然就会加载到0号GPU上去。
十分简单。只需要定义cuda编号，然后将模型与数据加载上去。
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #8B8878;"># </span><span style="color: #8B8878;">set device</span>
<span style="color: #FF8C00;">device</span> = <span style="color: #CDC673;">'cuda:2'</span> <span style="color: #FF1493;">if</span> args.cuda <span style="color: #FF1493;">else</span> <span style="color: #CDC673;">'cpu'</span>
<span style="color: #8B8878;"># </span><span style="color: #8B8878;">set environment</span>
<span style="color: #FF8C00;">os.environ</span><span style="color: #AF87FF;">[</span><span style="color: #CDC673;">"CUDA_VISIBLE_DEVICES"</span><span style="color: #AF87FF;">]</span> = <span style="color: #CDC673;">"2,3,4"</span>
model.to<span style="color: #AF87FF;">(</span>device<span style="color: #AF87FF;">)</span>
data.to<span style="color: #AF87FF;">(</span>device<span style="color: #AF87FF;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbd46aab" class="outline-3">
<h3 id="orgbd46aab"><span class="section-number-3">1.3</span> 多GPU模式使用与指定主GPU</h3>
<div class="outline-text-3" id="text-1-3">
<p>
多GPU主要是使用到了Parallel方法，此处展示一个示例：
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #8B8878;"># </span><span style="color: #8B8878;">set device</span>
<span style="color: #FF8C00;">device</span> = <span style="color: #CDC673;">'cuda:2'</span> <span style="color: #FF1493;">if</span> args.cuda <span style="color: #FF1493;">else</span> <span style="color: #CDC673;">'cpu'</span>

<span style="color: #8B8878;"># </span><span style="color: #8B8878;">args.device="2,3,4"</span>

<span style="color: #8B8878;"># </span><span style="color: #8B8878;">set environment</span>
<span style="color: #FF8C00;">os.environ</span><span style="color: #AF87FF;">[</span><span style="color: #CDC673;">"CUDA_VISIBLE_DEVICES"</span><span style="color: #AF87FF;">]</span> =args.device
<span style="color: #FF1493;">if</span> args.cuda <span style="color: #FF1493;">and</span> torch.cuda.device_count<span style="color: #AF87FF;">()</span> &gt; 1:
        LOGGER.info<span style="color: #AF87FF;">(</span><span style="color: #CDC673;">"Let's use GPUs to train"</span><span style="color: #AF87FF;">)</span>
        <span style="color: #FF8C00;">model</span> = DataParallel<span style="color: #AF87FF;">(</span>model, device_ids=<span style="color: #5FD7FF;">[</span><span style="color: #FF1493;">int</span><span style="color: #87D700;">(</span>i<span style="color: #87D700;">)</span> <span style="color: #FF1493;">for</span> i <span style="color: #FF1493;">in</span> args.device.split<span style="color: #87D700;">(</span><span style="color: #CDC673;">','</span><span style="color: #87D700;">)</span><span style="color: #5FD7FF;">]</span><span style="color: #AF87FF;">)</span>
        <span style="color: #FF8C00;">multi_gpu</span> = <span style="color: #AF87FF;">True</span>
model.to<span style="color: #AF87FF;">(</span>device<span style="color: #AF87FF;">)</span>
data.to<span style="color: #AF87FF;">(</span>device<span style="color: #AF87FF;">)</span>
</pre>
</div>




<p>
lalala
</p>




<p>
something not interesting.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: LiangZi</p>
<p class="date">Created: 2021-11-15 Mon 20:45</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
